const products = [
  {
    article: 80178,
    visible: true,
    id: '5fb37abb5225b630baf8499d',
    title: 'Гибкая черепица Технониколь Shinglas атлантика, мадейра (1,5м2)',
    cost: 2076,
    club_cost: 1869,
    options: [
      {
        key: 'Количество слоев',
        value: 'Многослойная',
      },
      {
        key: 'Коллекция',
        value: 'Атлантика',
      },
      {
        key: 'Форма нарезки',
        value: 'Атлантика',
      },
      {
        key: 'Тип товара',
        value: 'Гибкая черепица',
      },
      {
        key: 'Оттенок',
        value: 'Мадейра',
      },
      {
        key: 'Цвет',
        value: 'Светло-коричневый',
      },
    ],
    images: ['3a5fde53-2974-47d3-ac8f-cef44f12eecb.jpg', '70325d83-50e7-47e4-8e52-56b60dd0af9b.jpg'],
    path: '/uploads/catalog/5f85ba274a9a5d34e0a45fed/categories/5fb3765e5225b630baf846ac/5fb37abb5225b630baf8499d/',
    unit: 'за м2',
    coef: 1.5,
    description:
      'Уникальная природа второго по величине океана Земного шара стала прообразом новой формы трехслойной черепицы. В ее линиях прослеживается рисунок бескрайних волн Атлантики. Цветовая палитра трехслойной коллекции «Атлантика» вторит разнообразию ландшафтов океанических островов, передавая красоту местной природы через неповторимый трехмерный рельеф черепицы. Гарантия на коллекцию составляет – 60 лет.',
    slug: 'gibkaya-cherepicza-texnonikol-shinglas-atlantika-madejra-1-5-m-2',
  },
  {
    article: 80179,
    visible: true,
    id: '5fb37ac35225b630baf8499f',
    title: 'Гибкая черепица Технониколь Shinglas атлантика, тенерифе (1,5м2)',
    cost: 2076,
    club_cost: 1869,
    options: [
      {
        key: 'Количество слоев',
        value: 'Многослойная',
      },
      {
        key: 'Коллекция',
        value: 'Атлантика',
      },
      {
        key: 'Форма нарезки',
        value: 'Атлантика',
      },
      {
        key: 'Тип товара',
        value: 'Гибкая черепица',
      },
      {
        key: 'Оттенок',
        value: 'Тенерифе',
      },
      {
        key: 'Цвет',
        value: 'Коричневый',
      },
    ],
    images: ['5e7a36ec-0373-43b8-884b-708a1459f499.jpg', 'fa908d3f-2cbf-4b33-8ca4-51f52e5e0749.jpg'],
    path: '/uploads/catalog/5f85ba274a9a5d34e0a45fed/categories/5fb3765e5225b630baf846ac/5fb37ac35225b630baf8499f/',
    unit: 'за м2',
    coef: 1.5,
    description:
      'Уникальная природа второго по величине океана Земного шара стала прообразом новой формы трехслойной черепицы. В ее линиях прослеживается рисунок бескрайних волн Атлантики. Цветовая палитра трехслойной коллекции «Атлантика» вторит разнообразию ландшафтов океанических островов, передавая красоту местной природы через неповторимый трехмерный рельеф черепицы. Гарантия на коллекцию составляет – 60 лет.',
    slug: 'gibkaya-cherepicza-texnonikol-shinglas-atlantika-tenerife-1-5-m-2',
  },
  {
    article: 80180,
    visible: true,
    id: '5fb37a6f5225b630baf8498d',
    title: 'Гибкая черепица Технониколь Shinglas вестерн, каньон (1,5м2)',
    cost: 1438,
    club_cost: 1294,
    options: [
      {
        key: 'Количество слоев',
        value: 'Многослойная',
      },
      {
        key: 'Коллекция',
        value: 'Вестерн',
      },
      {
        key: 'Форма нарезки',
        value: 'Вестерн',
      },
      {
        key: 'Тип товара',
        value: 'Гибкая черепица',
      },
      {
        key: 'Оттенок',
        value: 'Каньон',
      },
      {
        key: 'Цвет',
        value: 'Коричневый',
      },
    ],
    images: ['470d8a31-798d-415a-9fda-ff5948242ad7.jpg', '9c08f9e3-d2aa-46e5-b9ce-36948a072170.jpg'],
    path: '/uploads/catalog/5f85ba274a9a5d34e0a45fed/categories/5fb3765e5225b630baf846ac/5fb37a6f5225b630baf8498d/',
    unit: 'за м2',
    coef: 1.5,
    description:
      'Двухслойная черепица с запатентованной формой нарезки, не имеющая аналогов в мире, добавляет классическому облику черепицы неповторимый голографический объём. Это сочетание уникальных оттенков и великолепных технических характеристик, которые придают кровле особые прочностные свойства. Гарантия на коллекцию составляет – 55 лет!\r\n',
    slug: 'gibkaya-cherepicza-texnonikol-shinglas-vestern-kanon-1-5-m-2',
  },
  {
    article: 80181,
    visible: true,
    id: '5fb37a795225b630baf8498f',
    title: 'Гибкая черепица Технониколь Shinglas вестерн, клондайк (1,5м2)',
    cost: 1438,
    club_cost: 1294,
    options: [
      {
        key: 'Количество слоев',
        value: 'Многослойная',
      },
      {
        key: 'Коллекция',
        value: 'Вестерн',
      },
      {
        key: 'Форма нарезки',
        value: 'Вестерн',
      },
      {
        key: 'Тип товара',
        value: 'Гибкая черепица',
      },
      {
        key: 'Оттенок',
        value: 'Клондайк',
      },
      {
        key: 'Цвет',
        value: 'Серо-коричневый',
      },
    ],
    images: ['1dbc1628-d981-4fdb-af06-7cc84f371552.jpg', 'b5023319-f0e5-414b-9d71-c20f8a915148.jpg'],
    path: '/uploads/catalog/5f85ba274a9a5d34e0a45fed/categories/5fb3765e5225b630baf846ac/5fb37a795225b630baf8498f/',
    unit: 'за м2',
    coef: 1.5,
    description:
      'Двухслойная черепица с запатентованной формой нарезки, не имеющая аналогов в мире, добавляет классическому облику черепицы неповторимый голографический объём. Это сочетание уникальных оттенков и великолепных технических характеристик, которые придают кровле особые прочностные свойства. Гарантия на коллекцию составляет – 55 лет!',
    slug: 'gibkaya-cherepicza-texnonikol-shinglas-vestern-klondajk-1-5-m-2',
  },
  {
    article: 80182,
    visible: true,
    id: '5fb37a825225b630baf84991',
    title: 'Гибкая черепица Технониколь Shinglas вестерн, ниагара (1,5м2)',
    cost: 1438,
    club_cost: 1294,
    options: [
      {
        key: 'Количество слоев',
        value: 'Многослойная',
      },
      {
        key: 'Коллекция',
        value: 'Вестерн',
      },
      {
        key: 'Форма нарезки',
        value: 'Вестерн',
      },
      {
        key: 'Тип товара',
        value: 'Гибкая черепица',
      },
      {
        key: 'Оттенок',
        value: 'Ниагара',
      },
      {
        key: 'Цвет',
        value: 'Серый',
      },
    ],
    images: ['015d9b5f-4a83-4c7a-9635-f5af4ea9110d.jpg', '90fcfe29-75f5-4b19-be7e-38c43be1d048.jpg'],
    path: '/uploads/catalog/5f85ba274a9a5d34e0a45fed/categories/5fb3765e5225b630baf846ac/5fb37a825225b630baf84991/',
    unit: 'за м2',
    coef: 1.5,
    description:
      'Двухслойная черепица с запатентованной формой нарезки, не имеющая аналогов в мире, добавляет классическому облику черепицы неповторимый голографический объём. Это сочетание уникальных оттенков и великолепных технических характеристик, которые придают кровле особые прочностные свойства. Гарантия на коллекцию составляет – 55 лет!',
    slug: 'gibkaya-cherepicza-texnonikol-shinglas-vestern-niagara-1-5-m-2',
  },
  {
    article: 80183,
    visible: true,
    id: '5fb37a8b5225b630baf84993',
    title: 'Гибкая черепица Технониколь Shinglas вестерн, прерия (1,5м2)',
    cost: 1438,
    club_cost: 1294,
    options: [
      {
        key: 'Количество слоев',
        value: 'Многослойная',
      },
      {
        key: 'Коллекция',
        value: 'Вестерн',
      },
      {
        key: 'Форма нарезки',
        value: 'Вестерн',
      },
      {
        key: 'Тип товара',
        value: 'Гибкая черепица',
      },
      {
        key: 'Оттенок',
        value: 'Прерия',
      },
      {
        key: 'Цвет',
        value: 'Светло-коричневый',
      },
    ],
    images: ['0d305734-8707-4f0a-b26e-861ac600afd4.jpg', '9d3b9d1c-b035-4f17-96fa-f74efe8e3cf3.jpg'],
    path: '/uploads/catalog/5f85ba274a9a5d34e0a45fed/categories/5fb3765e5225b630baf846ac/5fb37a8b5225b630baf84993/',
    unit: 'за м2',
    coef: 1.5,
    description:
      'Двухслойная черепица с запатентованной формой нарезки, не имеющая аналогов в мире, добавляет классическому облику черепицы неповторимый голографический объём. Это сочетание уникальных оттенков и великолепных технических характеристик, которые придают кровле особые прочностные свойства. Гарантия на коллекцию составляет – 55 лет!',
    slug: 'gibkaya-cherepicza-texnonikol-shinglas-vestern-preriya-1-5-m-2',
  },
  {
    article: 80184,
    visible: true,
    id: '5fb37a185225b630baf8497b',
    title: 'Гибкая черепица Технониколь Shinglas джаз, аликанте (2м2)',
    cost: 858,
    club_cost: 772,
    options: [
      {
        key: 'Количество слоев',
        value: 'Многослойная',
      },
      {
        key: 'Коллекция',
        value: 'Джаз',
      },
      {
        key: 'Форма нарезки',
        value: 'Драконий зуб',
      },
      {
        key: 'Тип товара',
        value: 'Гибкая черепица',
      },
      {
        key: 'Оттенок',
        value: 'Аликанте',
      },
      {
        key: 'Цвет',
        value: 'Бежевый',
      },
    ],
    images: ['c4fba46d-3f74-41be-934e-11f51d1517fc.jpg', 'b2af7cd4-1a76-4a84-a54d-480d91b80773.jpg'],
    path: '/uploads/catalog/5f85ba274a9a5d34e0a45fed/categories/5fb3765e5225b630baf846ac/5fb37a185225b630baf8497b/',
    unit: 'за м2',
    coef: 2,
    description:
      'Изысканная цветовая гамма, игра оттенков и 3D объем. Особая форма нарезки черепицы создаёт впечатление, что кровля выполнена из натурального штучного материала: дранки или сланца. Гарантия на коллекцию составляет – 60 лет!',
    slug: 'gibkaya-cherepicza-texnonikol-shinglas-dzhaz-alikante-2-m-2',
  },
  {
    article: 80185,
    visible: true,
    id: '5fb37a235225b630baf8497d',
    title: 'Гибкая черепица Технониколь Shinglas джаз, барселона (2м2)',
    cost: 858,
    club_cost: 772,
    options: [
      {
        key: 'Количество слоев',
        value: 'Многослойная',
      },
      {
        key: 'Коллекция',
        value: 'Джаз',
      },
      {
        key: 'Форма нарезки',
        value: 'Драконий зуб',
      },
      {
        key: 'Тип товара',
        value: 'Гибкая черепица',
      },
      {
        key: 'Оттенок',
        value: 'Барселона',
      },
      {
        key: 'Цвет',
        value: 'Коричнево-зеленый',
      },
    ],
    images: ['cf758129-db64-4aee-ad1c-b1bbd057c683.jpg', '41028ab4-35a3-47db-bbcf-6f18bac5f2d4.jpg'],
    path: '/uploads/catalog/5f85ba274a9a5d34e0a45fed/categories/5fb3765e5225b630baf846ac/5fb37a235225b630baf8497d/',
    unit: 'за м2',
    coef: 2,
    description:
      'Изысканная цветовая гамма, игра оттенков и 3D объем. Особая форма нарезки черепицы создаёт впечатление, что кровля выполнена из натурального штучного материала: дранки или сланца. Гарантия на коллекцию составляет – 60 лет!',
    slug: 'gibkaya-cherepicza-texnonikol-shinglas-dzhaz-barselona-2-m-2',
  },
];

let res = products.reduce((pre, cur, i) => {
  let _newOption = {
    slices: cur.options.find(({ key }) => key === 'Количество слоев')?.value,
    collection: cur.options.find(({ key }) => key === 'Коллекция')?.value,
    color: cur.options.find(({ key }) => key === 'Оттенок')?.value,
    prices: [
      {
        city: 'square',
        value: cur.cost,
      },
    ],
  };
  let _product = {
    id: `${i}`,
    info: {
      position: i,
      slug: `${i}`,
      title: cur.title,
      userTitle: cur.title,
    },
    desc: [],
    options: [_newOption],
  };

  return pre.concat(_product);
}, []);
console.log('🚀 ~ file: test.js ~ line 4613 ~ Array.prototype.reduce ~ products', res);
