{
  "id": 1,
  "website": "https://osbplita.by/",
  "path": "/main",
  "title": "Главная",
  "head": {
    "title": "Купить OSB плиты",
    "meta": [
      {
        "name": "keywords",
        "content": "осп, osb, плита osb 3, osb 3 цена, osb плита размеры и цены, лист osb, osb плита купить, плита осп 3, осп плита купить, осп osb плита, купить, цена, москва, мо, интернет, магазин, недорого, дешево, с доставкой, сбп, санкт-петербург, ло"
      },
      {
        "name": "description",
        "content": "ОСП (OSB) плиты от производителей Талион, Kronospan, Калевала, Муром в наличии по самым выгодным ценам."
      }
    ]
  },
  "content": {
    "main": [
      "Высокое качество по доступной цене",
      "от 645 руб/шт",
      "Плиты производятся из плоских древесных стружек или щепы. Для производства OSB плит больше всего подходит сырье из хвойных пород, но также используют и осину, тополь и т. д. В отличие от прочих стружечных плит (ДСП, к примеру), в ОСП щепа укладывается в заданном направлении. Именно поэтому такие стружечные плиты называются ориентированными. Поскольку ОСБ плиты состоят из нескольких (обычно из трех) слоев, направление стружки в слоях чередуется, благодаря чему эти плиты более прочные.",
      "images/osb/main"
    ],
    "catalog": [
      [
        "Размеры и цены",
        "ОСП (OSB)"
      ],
      "У нас представлены плиты разных размеров",
      [
        "Что такое",
        "ОСП (OSB)?"
      ],
      [
        "Название OSB расшифровывается просто – это начальные буквы слов orient strand board, которые переводятся как ориентировано-стружечная плита. Также плиты могут называть ОСБ панелями, осп листами или просто ОСБ или ОСП. <br /> OSB плиты нашли широкое применение в домостроение. В частности, они являются частью СИП панелей, материала, использующегося для строительства домов из СИП панелей. <br /> ОСБ плита – это листы размером примерно 2,5 на 1, 25 м. Толщина плит бывает разной, она варьируется от 6 до 38 мм. Для удобства монтажа плиты могут иметь обработанные торцы по принципу «паз-гребень»."
      ],
      [
        [
          "images/icon1.png",
          90,
          "СТРУЖКИ ДРЕВЕСИНЫ СОСНЫ"
        ],
        [
          "images/icon2.png",
          8,
          "СПЕЦИАЛЬНЫЙ КЛЕЙ"
        ],
        [
          "images/icon3.png",
          2,
          "ДОПОЛНИТЕЛЬНЫЕ ВОЛОКНА"
        ]
      ],
      [
        "Купить ОСП(OSB) плиты — не проблема. Звоните нам!"
      ],
      "Доставка по Москве и Московской области"
    ],
    "advantages": [
      [
        "Достоинства",
        "ОСП (OSB) плит"
      ],
      [
        [
          "ЭКОЛОГИЧНОСТЬ",
          "Еще на производстве лист осб подвергается анализу для усовершенствования положительных качеств этого стройматериала. Одним из главных преимуществ этого стройматериала является экологичность. Несмотря на большое количество толков о содержании формальдегида в плитах осб, следует учитывать то факт, что ведущие производители сейчас используют полимерные смолы в качестве связующего материала. А они в свою очередь не содержат фенол, который является токсичным. Класс эмиссии осб плит E1 (EN ISO 12460-5). Согласно этому классу, содержание формальдегида допускается в количестве до 8 мг/100 г сухой плиты."
        ],
        [
          "ЛЕГКОВЕСНОСТЬ",
          "Сравнивая с другими плитами OSB плиты обычно бывают легкого веса. Если самый легкий лист гипсакартона весит 25 кг, то вес OSB стартует от 10 кг. Это позволяет легко обработывать. Работать с плитами проще, чем с натуральной древесиной."
        ],
        [
          "ЗВУКОИЗОЛЯЦИЯ",
          "Высокая плотность защищают от ударного шума внутри дома. По болшой части звукоизоляция зависит от толщины материала: чем больще толщина тем меньше шума."
        ],
        [
          "ВЛАГОСТОЙКОСТЬ",
          "Несмотря на то что основной материал в плитах стружки дерева, плиты влагостойкие. Влагостойкость обеспечивается за счет специального клейа, которая используется для изготовление плит. Среда материала не способствует размножению насекомых и патогенных микроорганизмов."
        ],
        [
          "СТОИМОСТЬ",
          "Цена плит ОСП стартует от 5800 ₸/шт 9мм толщиной 1240мм длиной и 2440 высотой, в то время как цена листа фанеры 4мм 1500мм высотой и 1500мм длиной стартует от 500р/шт."
        ],
        [
          "ЗАЩИТА ОТ ХОЛОДА",
          "Низкая теплопроводность не позволяет теплу выходить наружу, а холоду - проникать внутрь."
        ],
        [
          "ПРОСТОТА МОНТАЖА",
          "Удобный формат плит и экологичность материала позволяют производить монтаж вручную без использования защитных средств. Плиты плотно стыкуются и при необходимости легко нарезаются до нужного размера."
        ]
      ],
      [
        "Применение",
        "ОСП (OSB)"
      ],
      [
        [
          "ДЕКОРАТИВНАЯ ОБРАБОТКА",
          "Часто ОСП используется в декоративных целях. Для этого его покрывают морилкой, которая одновременно с окраской оказывает и антисептический эффект. Также используется патинирование плит – это искусственное состаривание материала. На грунтовку наносится слой краски, который стирается на выступающих местах, а в углублениях остается."
        ],
        [
          "КАРКАСНОЕ ДОМОСТРОЕНИЕ",
          "Способ возведения домов, отличается простотой и быстротой строительства. Основу сооружения составляет деревянный или металлический каркас, на котором закрепляют стены и перегородки из ОСП. Для внешних стен используется марка ОСП-3, для внутренних – ОСП-2. Толщину листа подбирают в зависимости от толщины стен."
        ],
        [
          "ВНУТРЕННИЕ ПЕРЕГОРОДКИ",
          "Разграничивают помещение в доме на комнаты. Простота монтажа, небольшой вес, хорошая звукоизоляция делают ОСП хорошим выбором для этих сооружений. Для этих целей подойдут марки ОСП-2 и ОСП-3, последний вариант предпочтительней, если планируется производить отделку жидкими материалами. Также обязательно надо обратить внимание на класс эмиссии, он должен быть не больше 1."
        ],
        [
          "УСТАНОВКА ПОЛОВ",
          "OSB может использоваться для создания чернового пола. Монтаж может производиться прямо на бетон или на лаги. Стружечная структура хорошо удерживает крепежные элементы, поэтому проблем с фиксацией не должно возникнуть. Если плита укладывается на бетонную стяжку, то достаточно небольшой толщины – 10 мм. Если пол укладывается на лаги, потребуется покрытие от 18 – 22 мм в зависимости от расстояния между лагами. Из марок лучше всего использовать ОСП-3 или ОСП-4."
        ],
        [
          "СООРУЖЕНИЕ КРЫШИ",
          "При сплошной обрешетке в качестве покрытия часто используются ориентированно-стружечные плиты. Они позволяют создать сплошной настил для последующего монтажа кровли. Для крыши используются ОСП-2 и ОСП-3. Толщина плит должна быть больше 22 мм в зависимости от шага обрешетки. Монтируются листы стык в стык."
        ],
        [
          "СОЗДАНИЯ ОПАЛУБКИ",
          "Для временной конструкции при заливке фундамента часто используются ламинированные листы ОСП-3. Они надежно защищены от влаги, поэтому их износостойкости хватит для многократного использования."
        ],
        [
          "ДРУГИЕ СФЕРЫ ИСПОЛЬЗОВАНИЯ",
          "ОСП используется в качестве декоративного материала при оформлении помещений, при создании мебели, ящиков, для отделки кузовов автомобилей."
        ]
      ]
    ],
    "gallery": [
      [
        "Примеры использования",
        "ОСП (OSB)"
      ],
      "ОСП (OSB) применяются при строительстве зданий, из него делают перекрытия, каркасы стен, крыш и опалубки.",
      [
        [
          "images/plitaosb-3.ru/examples/example1",
          "Декоративная обработка"
        ],
        [
          "images/plitaosb-3.ru/examples/example2",
          "Каркасное домостроение"
        ],
        [
          "images/plitaosb-3.ru/examples/example3",
          "Внутренние перегородки"
        ],
        [
          "images/plitaosb-3.ru/examples/example4",
          "Установка полов"
        ],
        [
          "images/plitaosb-3.ru/examples/example5",
          "Сооружение крыши"
        ],
        [
          "images/plitaosb-3.ru/examples/example6",
          "Создания опалубки"
        ]
      ]
    ]
  }
}