{
  "id": 6,
  "website": "shinglas-rus.ru",
  "path": "/main",
  "title": "Главная",
  "head": {
    "title": "Купить мягкую кровлю, гибкую черепицу Технониколь Шинглас в Москве и МО",
    "meta": [
      {
        "name": "keywords",
        "content": "кровля технониколь цена, шинглас купить, шинглас цена, черепица технониколь цена, технониколь кровля купить, мягкая кровля технониколь цены, черепица технониколь купить, гибкая черепица технониколь цена, купить черепицу шинглас, shinglas, купить, интернет, магазин, цена, москва, мо, московская область, недорого, дешево, с доставкой"
      },
      {
        "name": "description",
        "content": "Купить мягкую кровлю, гибкую черепицу Технониколь Шинглас (Shinglas)в Москве и МО с доставкой недорого позволит наша низкая цена. Большой выбор!"
      }
    ]
  },
  "content": {
    "main": [
      "Однослойная и многослойная черепица",
      "от 285 руб/м2",
      [
        "Прямые поставки от производителя <br/> Низкие цены <br/> Доставка по всей России"
      ],
      "images/shinglas/main"
    ],
    "catalog": [
      [
        "Каталог и цены",
        "черепицы Shinglas"
      ],
      [],
      [
        "Ассортимент гибкой черепицы",
        "Shinglas"
      ],
      [
        "Одним из товаров, которые успешно представляет на рынке стройматериалов известная корпорация Технониколь, является мягкая битумная черепица Шинглас. Производство осуществляется в соответствии с международными стандартами, контроль продукции выполняется на каждом уровне, поэтому она полностью соответствует европейским требованиям."
      ],
      [
        [
          "",
          "",
          [
            "<div class=\"text-zinc-100 flex flex-col items-center justify-center\"><div class=\"linearicons-lamp py-2\" style=\"color: red; font-size: 60px\"></div><div class=\"uppercase font-bold font-3xl\">Надёжная гидроизоляция</div><div class=\"max-w-sm text-center font-light\">Корпорация Технониколь на протяжении 26 лет выпускает качественные и надёжные строительные материалы, зарекомендовав себя ответственным производителем.</div></div>"
          ]
        ],
        [
          "",
          "",
          [
            "<div class=\"text-zinc-100 flex flex-col items-center justify-center\"><div class=\"linearicons-fire py-2\" style=\"color: red; font-size: 60px\"></div><div class=\"uppercase font-bold font-3xl\">Надёжная гидроизоляция</div><div class=\"max-w-sm text-center font-light\">Теплостойкость черепицы Shinglas составляет не менее 110°C, а сам материал обладает самозатухающими свойствами, то есть не поддерживает активное горение. </div></div>"
          ]
        ],
        [
          "",
          "",
          [
            "<div class=\"text-zinc-100 flex flex-col items-center justify-center\"><div class=\"linearicons-archery py-2\" style=\"color: red; font-size: 60px\"></div><div class=\"uppercase font-bold font-3xl\">Надёжная гидроизоляция</div><div class=\"max-w-sm text-center font-light\">Мы уверены в качестве нашей продукции и поэтому предоставляем всем нашим клиентам официальную гарантию на черепицу от 20 до 60 лет в зависимости от серии. </div></div>"
          ]
        ],
        [
          "",
          "",
          [
            "<div class=\"text-zinc-100 flex flex-col items-center justify-center\"><div class=\"linearicons-list3 py-2\" style=\"color: red; font-size: 60px\"></div><div class=\"uppercase font-bold font-3xl\">Надёжная гидроизоляция</div><div class=\"max-w-sm text-center font-light\">Линейка гибкой черепицы Shinglas представлена из 19 коллекций. Из 80 разных оттенков вы сможете подобрать черепицу по цене, инженерным и дизайнерским особенностям. </div></div>"
          ]
        ],
        [
          "",
          "",
          [
            "<div class=\"text-zinc-100 flex flex-col items-center justify-center\"><div class=\"linearicons-rank3 py-2\" style=\"color: red; font-size: 60px\"></div><div class=\"uppercase font-bold font-3xl\">Надёжная гидроизоляция</div><div class=\"max-w-sm text-center font-light\">Многослойная черепица состоит из нескольких слоёв сверхпрочного стеклохолста, кровельного битума и базальтовой посыпки. </div></div>"
          ]
        ],
        [
          "",
          "",
          [
            "<div class=\"text-zinc-100 flex flex-col items-center justify-center\"><div class=\"linearicons-rain py-2\" style=\"color: red; font-size: 60px\"></div><div class=\"uppercase font-bold font-3xl\">Надёжная гидроизоляция</div><div class=\"max-w-sm text-center font-light\">Современное производство довело до совершенства применения битума, соединив надёжные материалы: стеклохолст, кровельный (улучшенный) битум и природный базальт. </div></div>"
          ]
        ]
      ],
      [
        "Купить гибкую церепицу Shinglas — не проблема. Звоните нам!"
      ],
      "",
      [
        "<div class=\"text-3xl py-2 font-normal tracking-wide\"> Продукция от <span class=\"text-belplit24_2\">Технониколь</span> завоевала доверие многих клиентов</div> <br/> Благодаря надежности материала, изготовленного на основе стеклохолста (не боится коррозии и гниения), пропитанного с обеих сторон модифицированным битумом, что обеспечивает стойкость к перепадам температур. <br/>Лицевая сторона покрыта цветной посыпкой, в качестве которой выступает базальтовый гранулянт, предотвращающий воздействие ультрафиолета и обладающий отличными шумопоглощающими свойствами. <br/>Со внутренней стороны покрыта самоклеящимся слоем, благодаря которому, монтаж не требует особых усилий. Защитная пленка, прикрывающая самоклеящийся слой защищает от механических повреждений при хранении и перевозке. <br/>При изготовлении используются материалы высокого качества от всемирно известных производителей. <br/>Прежде, чем покупать мягкую кровлю Шинглас, стоит тщательно изучить основные линейки торгового бренда."
      ]
    ],
    "advantages": [
      [
        "Достоинства",
        "пиломатериалов"
      ],
      [
        [
          "Высокая несущая способность",
          "Первый плюс пиломатериала в том, что при высокой несущей способности сам он имеет относительно легкий вес, что дает возможность возводить крепкие, и, вмете с тем, легкие конструкции. Примером тому служат деревянные дома, которые делаются на минимальном фундаменте."
        ],
        [
          "Быстрота и легкость монтажа",
          "Другое преимущество пиломатериала — это быстрота и легкость монтажа. В этом пиломатериалу нет конкурентов. Никакой грязи, никакой техники, простота крепления и максимальная скорость. К тому же, если вы поставили в коттедже деревянные перекрытия, то можете смело приступать к продолжению работ, в отличие от бетона, после трудоемкой заливки которого еще примерно месяц нужно подождать."
        ],
        [
          "Экологичность",
          "Экологическая чистота, то есть, пиломатериалы являются природным и естественным материалом, который не может нанести вред здоровью человеку."
        ],
        [
          "Универсальность",
          "Пиломатериалы могут использоваться практически для любых конструкций. В отличие от металлов, они имеют множество возможностей и вариантов для использования."
        ],
        [
          "Способность \"дышать\"",
          "Благодаря этому свойству пиломатериалы отлично впитывают лишнюю влагу при ее избыточном скоплении в доме, а затем, при понижении температуры, отдают ее обратно."
        ],
        [
          "Простота обработки",
          "Пиломатериалы поддаются любым видам обработки, от простой шлифовки до сложных художественных работ. Кроме этого, пиломатериалы дают простор для творчества и фантазии."
        ],
        [
          "Тепло и звукоизоляция",
          "Это свойство достигается за счет того, что древесина имеет пористую структуру."
        ]
      ],
      [
        "Применение",
        "пиломатериалов"
      ],
      [
        [
          "Дома и бани",
          "Пилометериалы используются при строительстве домов и бань."
        ],
        [
          "Внутренняя отлелка",
          "Пиломатериалы применяются для отделки помещений, в том числе для обшивки стен."
        ],
        [
          "Изготовление мебели",
          "Изготовление мебели и других предметов интерьера."
        ],
        [
          "Упаковка",
          "Производство тары и различной упаковки."
        ]
      ]
    ],
    "gallery": [
      [
        "Примеры домов с черепицей",
        "Shinglas"
      ],
      "",
      [
        [
          "images/shinglas-rus.ru/examples/example1",
          "КОЛЛЕКЦИЯ ВЕСТЕРН"
        ],
        [
          "images/shinglas-rus.ru/examples/example2",
          "КОЛЛЕКЦИЯ АТЛАНТИКА"
        ],
        [
          "images/shinglas-rus.ru/examples/example3",
          "КОЛЛЕКЦИЯ КАНТРИ"
        ],
        [
          "images/shinglas-rus.ru/examples/example4",
          "КОЛЛЕКЦИЯ КОНТИНЕНТ"
        ]
      ]
    ]
  }
}