a = {
  type: ['Однослойная', 'Однослойная', 'Однослойная', 'Однослойная'],
  options: [
    [
      {
        key: 'Количество слоев',
        value: 'Однослойная',
      },
      {
        key: 'Коллекция',
        value: 'Аккорд',
      },
      {
        key: 'Серия',
        value: 'Финская',
      },
      {
        key: 'Цвет',
        value: 'Красный',
      },
      {
        key: 'Форма нарезки',
        value: 'Аккорд',
      },
      {
        key: 'Высота',
        value: '317 мм',
      },
      {
        key: 'Вес',
        value: '23,7 кг',
      },
      {
        key: 'Длина',
        value: '1000 мм',
      },
      {
        key: 'Толщина',
        value: '3 мм',
      },
      {
        key: 'Тип товара',
        value: 'Гибкая черепица',
      },
    ],
    [
      {
        key: 'Количество слоев',
        value: 'Однослойная',
      },
      {
        key: 'Коллекция',
        value: 'Аккорд',
      },
      {
        key: 'Серия',
        value: 'Финская',
      },
      {
        key: 'Цвет',
        value: 'Зеленый',
      },
      {
        key: 'Форма нарезки',
        value: 'Аккорд',
      },
      {
        key: 'Высота',
        value: '317 мм',
      },
      {
        key: 'Вес',
        value: '23,7 кг',
      },
      {
        key: 'Толщина',
        value: '3 мм',
      },
      {
        key: 'Длина',
        value: '1000 мм',
      },
      {
        key: 'Тип товара',
        value: 'Гибкая черепица',
      },
    ],
    [
      {
        key: 'Количество слоев',
        value: 'Однослойная',
      },
      {
        key: 'Серия',
        value: 'Финская',
      },
      {
        key: 'Коллекция',
        value: 'Аккорд',
      },
      {
        key: 'Цвет',
        value: 'Коричневый',
      },
      {
        key: 'Форма нарезки',
        value: 'Аккорд',
      },
      {
        key: 'Высота',
        value: '317 мм',
      },
      {
        key: 'Вес',
        value: '23,7 кг',
      },
      {
        key: 'Длина',
        value: '1000 мм',
      },
      {
        key: 'Толщина',
        value: '3 мм',
      },
      {
        key: 'Тип товара',
        value: 'Гибкая черепица',
      },
    ],
    [
      {
        key: 'Количество слоев',
        value: 'Однослойная',
      },
      {
        key: 'Серия',
        value: 'Финская',
      },
      {
        key: 'Коллекция',
        value: 'Аккорд',
      },
      {
        key: 'Цвет',
        value: 'Серый',
      },
      {
        key: 'Форма нарезки',
        value: 'Аккорд',
      },
      {
        key: 'Высота',
        value: '317 мм',
      },
      {
        key: 'Вес',
        value: '23,7 кг',
      },
      {
        key: 'Длина',
        value: '1000 мм',
      },
      {
        key: 'Толщина',
        value: '3 мм',
      },
      {
        key: 'Тип товара',
        value: 'Гибкая черепица',
      },
    ],
  ],
  title: 'Аккорд',
  infos: [
    'Гибкая черепица Технониколь Shinglas финская аккорд, красный (3м2)',
    'Гибкая черепица Технониколь Shinglas финская аккорд, зеленый (3м2)',
    'Гибкая черепица Технониколь Shinglas финская аккорд, коричневый (3м2)',
    'Гибкая черепица Технониколь Shinglas финская аккорд, серый (3м2)',
  ],
  prices: [347, 347, 347, 347],
  priceFor: ['за м2', 'за м2', 'за м2', 'за м2'],
  show: [true, true, true, true],
  articles: [80224, 80222, 80223, 80225],
  ids: [
    '5fb377eb5225b630baf84903',
    '5fb377d95225b630baf848ff',
    '5fb377e15225b630baf84901',
    '5fb377f45225b630baf84905',
  ],
  coef: [3, 3, 3, 3],
  imgs: [
    ['d0a0d3e8-38be-47ff-b8a5-933039cbc63f.jpg', 'a4ba79d8-13b1-4f6a-848c-ac3256c522de.jpg'],
    ['c8589fcc-a4b3-419a-9e37-b948b40bce58.jpg', 'db5c0daf-9ced-4ca7-af3b-61edf0715ef9.jpg'],
    ['44feb7db-8fe8-49d5-9b2e-1517ce40e275.jpg', '3d832d31-2626-49d4-bd7f-5cb095f4bc0c.jpg'],
    ['b1b15ddc-ca45-428f-8b0c-df8f530661a9.jpg', '08a49b65-87fe-451b-b846-0bc7f325c5e5.jpg'],
  ],
  paths: [
    '/uploads/catalog/5f85ba274a9a5d34e0a45fed/categories/5fb3765e5225b630baf846ac/5fb377eb5225b630baf84903/',
    '/uploads/catalog/5f85ba274a9a5d34e0a45fed/categories/5fb3765e5225b630baf846ac/5fb377d95225b630baf848ff/',
    '/uploads/catalog/5f85ba274a9a5d34e0a45fed/categories/5fb3765e5225b630baf846ac/5fb377e15225b630baf84901/',
    '/uploads/catalog/5f85ba274a9a5d34e0a45fed/categories/5fb3765e5225b630baf846ac/5fb377f45225b630baf84905/',
  ],
};
