{
  "id": 0,
  "path": "/main",
  "title": "Главная",
  "head": {
    "title": "Купить теплоизоляцию, звукоизоляцию, ветрозащиту, утеплитель, МДВП Белтермо",
    "meta": [
      {
        "name": "keywords",
        "content": "купить теплоизоляцию, звукоизоляция купить, мдвп плита, мдвп купить, мдвп цена, белплит (белтермо) купить, белплит (белтермо) цена, плиты белплит (белтермо), утеплитель белплит (белтермо), ветрозащитная плита белплит (белтермо), интернет, магазин, цена, москва, мо, московская область, недорого, дешево, с доставкой, белтермо, белтермо купить, белтермо москва и мо"
      },
      {
        "name": "description",
        "content": "Купить теплоизоляцию, звукоизоляцию, ветрозащиту, утеплитель, МДВП плиты Белтермо недорого позволит наша низкая цена."
      }
    ]
  },
  "content": {
    "main": [
      "Экологичная тепло-звукоизоляция дома",
      "от 289 руб.",
      "Плиты Белтермо - это природный материал на 94% состоящий из сосны! Предназначен для создания эффективной и экологически-чистой звуко/теплоизоляции дома, а также его ветрозащиты"
    ],
    "catalog": [
      "У нас представлены плиты всех размеров, с толщиной МДВП плиты от 20 до 200 мм.",
      [
        "Плиты Белтермо - это природный материал на 94% состоящий из сосны! <br /> У нас представлены плиты всех размеров, с толщиной МДВП плиты от 20 до 200 мм. <br /> Широкая линейка утеплителей БЕЛТЕРМО позволяет выбрать материал по его назначению,опираясь на свойства, характеристики и особенности исполнения каждого его вида."
      ],
      [
        ["images/icon1.png", 94, "ВОЛОКНА ДРЕВЕСИНЫ СОСНЫ"],
        ["images/icon2.png", 1.5, "ПАРАФИНОВАЯ ЭМУЛЬСИЯ"],
        ["images/icon3.png", 4, "СИНТЕТИЧЕСКИЕ ВОЛОКНА"]
      ]
    ],
    "advantages": [
      ["Купить тепло-изоляционные плиты Белтермо — <span className={``}>не проблема</span>. Звоните нам!"],
      "Доставка по Москве, Краснодару, Минску, Симферополю, Астрахани, Екатеринбургу и Санкт-Петербургу.",
      [
        [
          "Защита от жары",
          "Благодаря высокому значению теплоемкости (с=2100 Дж/(кг*К) в доме будет прохладно даже в жаркие дни, что позволяет сэкономить на использовании кондиционера."
        ],
        [
          "Защита от ветра",
          "Высокое сопротивление продуванию потокам воздуха (50 - 100 (кПа*с)/м³) обеспечивает надёжную защиту от ветра."
        ],
        [
          "Отличная звукоизоляция",
          "Высокая плотность (110-200 кг/м³) и однородность защищают от ударного шума внутри дома (Rw=23-27 Дб), а высокая пористость позволяет поглощать шум снаружи (άw=0,60-0,95)."
        ],
        [
          "Пожарная безопасность",
          "Инертность горения посредством обугливания не распространяет огонь (огнестойкость \"E\" (еврокласс по EN 13501-1)."
        ],
        [
          "Комфортный микроклимат",
          "Способность поглощать и отдавать атмосферную влагу (Sd=0,06-0,72 м) позволяет плитам «дышать», не теряя при этом своих технических характеристик, обеспечивая оптимальную влажность и предотвращая образование плесени или грибка на стенах и потолке."
        ],
        [
          "Защита от холода",
          "Низкая теплопроводность (λD= 0,038-0,041 Вт/м*К) не позволяет теплу выходить наружу, а холоду - проникать внутрь."
        ],
        [
          "Простота монтажа",
          "Удобный формат плит (прямая кромка/шип-паз/ступень) и экологичность материала позволяют производить монтаж вручную без использования защитных средств. Плиты плотно стыкуются и при необходимости легко нарезаются до нужного размера."
        ],
        [
          "Экологичность",
          "Наличие в составе только натуральной древесины (сосны) и экологически чистых связующих компонентов (смолы на полиуретановой основе MDI 4%) обеспечивает абсолютную безопасность для человека и окружающей среды."
        ]
      ],
      [
        [
          "Кровля",
          "Подкровельное применение - обеспечивает сохранение тепла и шумоизоляцию. Теплоемкость с=2100 Дж/(кг*К)."
        ],
        [
          "Ветрозащита",
          "Высокая плотность отдельных моделей Белтермо обеспечивает защиту от проникновения ветра. Сопротивление продуванию: до 100 (кПа*с)/м³."
        ],
        [
          "Звукоизоляция",
          "Пористость плит Белтермо дает высокие шумопоглощающие и звукоизолирующие характеристики. Rw=23-27 Дб, άw=0,60-0,95."
        ],
        [
          "Утепление",
          "Полное утепление практически всех конструкций дома: кровли, стен, перегородок, потолка и др. Теплопроводность λ: от 0,038 Вт/м*К."
        ],
        ["Мокрый фасад", "Утепление стен плитами Белтермо позволяет использовать их \"под штукатурку\"."],
        [
          "Плавающий пол",
          "Внутренняя изоляция напольных покрытий защищает от проникновения холода и обеспечивает звукоизоляцию."
        ]
      ]
    ],
    "gallery": [
      "МДВП Белтермо применяются в самых разных областях строительства, для самых разных целей.",

      [
        [
          "images/example1.jpg",
          "Внутренняя изоляции перекрытий под стяжку бесшовных полов (ламинат, паркетная доска)"
        ],
        ["images/example2.jpg", "Внутренняя изоляция стен"],
        ["images/example3.jpg", "Утепление зданий"],
        ["images/example4.jpg", "Внешняя изоляция крыш каркасных домов"],
        ["images/example5.jpg", "Утепление внешних стен (мокрый фасад) плитами Белтермо"],
        ["images/example6.jpg", "Изоляция межэтажных перекрытий и потолка"]
      ]
    ]
  }
}
