{
	"url": "shinglas.site",
	"logo": "CSKLogo",
	"api": {
		"ym": "",
		"email": "/api/sendmail",
		"products": "",
		"serv": "https://xn--j1ano.com/"
	},
	"title": "Фанера",
	"productTitle": "Фанера",
	"misc": {
		"slider": []
	},
	"contacts": {
		"phones": [
			"+7 (988) 577-18-30"
		],
		"emails": [
			"alexey.andreev@td-csk.ru"
		],
		"addresses": [
			{
				"title": "Офис",
				"value": "Москва, Проектируемый проезд № 134, вл.4",
				"iframe": "https://api-maps.yandex.ru/frame/v1/-/CCUYiXRD-B"
			}
		],
		"socials": [
			[
				"Whatsapp",
				"https://wa.me/+79151012913&text=Здравствуйте!"
			]
		],
		"workingHoars": [
			"<span class=\"font-bold\">8:00–19:00</span> без выходных"
		],
		"requisites": []
	},
	"menu": [
		[
			"Главная",
			"#main"
		],
		[
			"Цены",
			"#prices"
		],
		[
			"Преимущества",
			"#advantages"
		],
		[
			"Применение",
			"#gallery"
		],
		[
			"Контакты",
			"#contacts"
		]
	],
	"content": {
		"preHeader": {},
		"header": {
			"left": [
				[
					"Logo",
					"Title"
				],
				"flex"
			],
			"center": [
				[
					"Menu"
				]
			],
			"right": [
				[
					"Phone",
					"FeedBackLink"
				],
				"flex flex-col"
			]
		},
		"template": [
			{
				"model": "MainScreenM2",
				"id": "main",
				"title": [
					"<span>Фанера</span>"
				],
				"subTitle": [
					"Высокое качество по доступной цене"
				],
				"text": [
					"Один из самых востребованных, известных, но не теряющих популярность материалов на строительном рынке – это фанера. Производятся фанерные листы следующим образом: прессованный древесный шпон укладывается крест-накрест и проклеивается. Такое расположение создает полотну дополнительную прочность. Листы могут быть толщиной от 0,4 до 4 см, в зависимости от количества слоев."
				],
				"price": [
					"от <span class=\"font-black text-bp_red_2 text-3xl\">420</span> ₽/шт"
				],
				"images": [
					"images/fanera/main01.webp"
				]
			},
			{
				"model": "CatalogM2",
				"id": "prices",
				"title": [
					"Размеры и цены <span class=\"text-bp_red_2 font-bold\">фанеры</span>"
				],
				"subTitle": [
					"У нас представлены фанера разных размеров и производителей"
				],
				"productModel": "ProductCardM1",
				"filters": [
					{
						"key": "color",
						"title": "Оттенок"
					},
					{
						"key": "collection",
						"title": "Коллекция"
					}
				]
			},
			{
				"model": "AboutM0",
				"title": [
					"Полезная информация"
				],
				"text": [
					"Исходя из состава и наличия дополнительной обработки, можно выделить:",
					"<br/><span class=\"font-bold\">ФК</span> – в роли клеевого соединения — карбамидная смола, используется для внутренних отделочных работ;",
					"<br/><span class=\"font-bold\">ФСФ</span> – слои шпона соединяет фенольная смола. Эта фанера устойчива к влаге, чаще всего требуется при благоустройстве кровли, для отделки внутри зданий используется все реже из-за возможных испарений фенола, вредных для здоровья;",
					"<br/><span class=\"font-bold\">ФОФ</span> – ФСФ фанера, ламинированная влагостойким слоем, идеальное решение для опалубков; ФКМ – шпон склеивается меламиновыми смолами, нашел применение этот вид больше всего для изготовления мебели и различных внутренних работ. Кроме перечисленных типов, есть специализированные фанерные листы, среди которых гибкая, бакелизированная и морская фанера, но в розничной продаже они встречаются крайне редко из-за специфичных характеристик. <br/> Еще один важный параметр, по которому подразделяют фанеру – это вариант обработки поверхности. Тут бывают следующие варианты: нешлифованная (НШ), со шлифовкой с одной (Ш1) или с обработкой обеих сторон (Ш2). Также не стоит упускать сортовую классификацию, она может быть от одного до четырех, где один – лучший. 1 – это самое хорошее качество, без недочетов и дефектов, например, сучков и червоточин, а 4 – низкого качества."
				]
			},
			{
				"model": "AdvantagesM0",
				"id": "advantages",
				"blocks": [
					{
						"title": [
							"Достоинства <span class=\"text-bp_red_2 font-bold\">фанеры</span>"
						],
						"text": [
							[
								"ВЛАГОСТОЙКОСТЬ",
								"Фанера – влагостойкий строительный материал, который подвержен отрицательному воздействию влаги почти в 2 раза меньше, нежели доска. Поэтому фанера – отличный материал для облицовки стен или настила полов, а также других работ, где неизбежен контакт с влагой."
							],
							[
								"ГИБКОСТЬ",
								"Фанера гнется. Это еще одно ее преимущество перед негнущейся доской. Именно это качество делает ее незаменимой в изготовлении мебели и излюбленным стройматериалом многих."
							],
							[
								"МАЛО ТРЕСКАЕТСЯ",
								"Фанера не коробится и гниет в 2 раза медленнее натуральной древесины. Еще один неоспоримый плюс этого строительного материала. Фанера не подвержена деформации за счет своей влагоустойчивости."
							],
							[
								"ИЗНОСОУСТОЙЧИСВОСТЬ",
								"Выше мы уже говорили о таких преимуществах фанеры как влагостойкость, гибкость, медленное гниение. Из этого стоит сделать вывод о том, что фанера очень износоустойчивый материал."
							],
							[
								"СТОИМОСТЬ",
								"Цена фанеры стартует от 420 рублей за штуку за лист толщиной 4мм и размером 1525х1525мм"
							],
							[
								"ЗАЩИТА ОТ ХОЛОДА",
								"Низкая теплопроводность не позволяет теплу выходить наружу, а холоду - проникать внутрь."
							],
							[
								"ПРОСТОТА В МОНТАЖЕ",
								"Этот строительный материал не только практичен и удобен в применении, но и очень прост в монтаже. На монтаж фанеры уходит минимум времени, сил и других стройматериалов."
							]
						]
					},
					{
						"title": [
							"Применение <span class=\"text-bp_red_2 font-bold\">фанеры</span>"
						],
						"text": [
							[
								"ОБЛИЦОВКА СТЕН",
								"Основное преимущество отделки стен фанерой – минимальная стоимость. Чаще всего этот материал используют для обшивки подсобных помещений."
							],
							[
								"ВОЗВЕДЕНИЕ КРЫШ И ПЕРЕГОРОДОК",
								"При сплошной обрешетке в качестве покрытия часто используются ориентированно-стружечные плиты. Они позволяют создать сплошной настил для последующего монтажа кровли. Толщина плит должна быть больше 10 мм в зависимости от шага обрешетки. Монтируются листы стык в стык."
							],
							[
								"УСТАНОВКА ПОЛОВ",
								"Фанера может использоваться для создания чернового пола. Монтаж может производиться прямо на бетон или на лаги. Структура дерева хорошо удерживает крепежные элементы, поэтому проблем с фиксацией не должно возникнуть. Если плита укладывается на бетонную стяжку, то достаточно небольшой толщины – 10 мм. Если пол укладывается на лаги, потребуется покрытие от 18 – 22 мм в зависимости от расстояния между лагами."
							],
							[
								"СОЗДАНИЯ ОПАЛУБКИ",
								"Для временной конструкции при заливке фундамента часто используются фанеру. Они надежно защищены от влаги, поэтому их износостойкости хватит для многократного использования."
							],
							[
								"ДРУГИЕ СФЕРЫ ИСПОЛЬЗОВАНИЯ",
								"Фанера используется в качестве декоративного материала при оформлении помещений, при создании мебели, ящиков, для отделки кузовов автомобилей."
							]
						]
					}
				]
			},
			{
				"model": "GalleryM0",
				"id": "gallery",
				"title": [
					"Примеры использования <span class=\"text-bp_red_2 font-bold\">фанеры</span>"
				],
				"images": [
					[
						"images/fanera/example1.webp",
						"ДЕКОРАТИВНАЯ ОБРАБОТКА"
					],
					[
						"images/fanera/example2.webp",
						"КАРКАСНОЕ ДОМОСТРОЕНИЕ"
					],
					[
						"images/fanera/example3.webp",
						"ОБЛИЦОВКА СТЕН"
					],
					[
						"images/fanera/example4.webp",
						"УСТАНОВКА ПОЛОВ"
					],
					[
						"images/fanera/example5.webp",
						"СООРУЖЕНИЕ КРЫШИ"
					],
					[
						"images/fanera/example6.webp",
						"СОЗДАНИЕ ОПАЛУБКИ"
					]
				]
			},
			{
				"model": "ContactsM1",
				"id": "contacts",
				"title": "Контакты"
			},
			{
				"model": "FooterM0"
			}
		]
	}
}